const MBTI = {
    totalQuestions: 70,
    questions: [
        {
            id: 0,
            question: "این تست دارای ۷۰ سوال است. در پاسخ به سوالات، گزینه‌ای را انتخاب کنید که به شخصیت واقعی شما نزدیک‌‌تر است، نه ویژگی‌هایی که می‌خواهید داشته باشید. پاسخ درست یا غلط وجود ندارد. به تمامی سوالات با دقت پاسخ دهید.",
            choices: [],
        },
        {
            id: 1,
            question: "شما در یک مهمانی:",
            choices: [
                { text: "با تعداد زیادی از افراد، از جمله غریبه‌ها تعامل می‌کنید.", answer: true, id: 0},
                { text: "با تعداد کمی از افراد که می‌شناسید تعامل می‌کنید.", answer: true, id: 1},
            ],
        },
        {
            id: 2,
            question: "کدام عبارت توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "بیشتر واقع‌بین هستم تا خیال‌پرداز.", answer: true, id: 0},
                { text: "بیشتر خیال‌پرداز هستم تا واقع‌بین.", answer: true, id: 1},
            ],
        },
        {
            id: 3,
            question: "کدام مورد از نظر شما بدتر است؟",
            choices: [
                { text: "سرگرم امیال و خیالات بودن", answer: true, id: 0},
                { text: "درگیر یک روتین تکراری بودن", answer: true, id: 1},
            ],
        },
        {
            id: 4,
            question: "بیشتر تحت تاثیر کدام مورد هستید؟",
            choices: [
                { text: "اصول و قواعد", answer: true, id: 0},
                { text: "احساسات", answer: true, id: 1},
            ],
        },
        {
            id: 5,
            question: "بیشتر به کدام مورد کشیده می‌شوید؟",
            choices: [
                { text: "چیزهای قانع کننده", answer: true, id: 0},
                { text: "چیزهای احساسی", answer: true, id: 1},
            ],
        },
        {
            id: 6,
            question: "ترجیح می‌دهید تحت کدام مورد کار کنید؟",
            choices: [
                { text: "تا ددلاین", answer: true, id: 0},
                { text: "هر وقت که شد", answer: true, id: 1},
            ],
        },
        {
            id: 7,
            question: "کدام عبارت در مورد شما درست است؟",
            choices: [
                { text: "با احتیاط انتخاب کنید.", answer: true, id: 0},
                { text: "چیزی را بدون فکر کردن انتخاب کنید", answer: true, id: 1},
            ],
        },
        {
            id: 8,
            question: "در مهمانی‌ها:",
            choices: [
                { text: "تا دیر وقت می‌مانید و انرژیتان به مرور بیشتر می‌شود.", answer: true, id: 0},
                { text: "انرژیتان به مرور کم شده و زود مهمانی را ترک می‌کنید.", answer: true, id: 1},
            ],
        },
        {
            id: 9,
            question: "بیشتر جذب کدام دسته از آدم‌ها می‌شوید؟",
            choices: [
                { text: "منطقی و فهیم", answer: true, id: 0},
                { text: "خلاق و مبتکر", answer: true, id: 1},
            ],
        },
        {
            id: 10,
            question: "کدام مورد برای شما جالب‌تر است؟",
            choices: [
                { text: "چیزهای واقعی", answer: true, id: 0},
                { text:"چیزهای احتمالی", answer: true, id: 1},
            ],
        },
        {
            id: 11,
            question: "کدام مورد بیشتر در قضاوت شما تاثیرگذار است؟",
            choices: [
                { text: "قوانین", answer: true, id: 0},
                { text: "شرایط", answer: true, id: 1},
            ],
        },
        {
            id: 12,
            question: "بیشتر مایلید در چه مورد از دیگران بپرسید؟",
            choices: [
                { text: "موضوعی", answer: true, id: 0},
                { text: "شخصی", answer: true, id: 1},
            ],
        },
        {
            /* not sure about the translation */
            id: 13,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "وقت‌شناس هستید", answer: true, id: 0},
                { text: "راحت هستید", answer: true, id: 1},
            ],
        },
        {
            id: 14,
            question: "کدام چیزها برای شما آزاردهنده‌تر است؟",
            choices: [
                { text: "چیزهای ناتمام", answer: true, id: 0},
                { text: "چیزهای تمام شده", answer: true, id: 1},
            ],
        },
        {
            id: 15,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "در گروه‌های اجتماعی پیگیر حواشی مرتبط با دیگران هستید.", answer: true, id: 0},
                { text: "در گروه‌های اجتماعی، از حواشی و اخبار مربوط به دیگران عقب هستید.", answer: true, id: 1},
            ],
        },
        {
            id: 16,
            question: "در انجام کارهای معمولی و روزمره:",
            choices: [
                { text: "ترجیح می‌دهید آنها را به روش معمول انجام دهید.", answer: true, id: 0},
                { text: "ترجیح می‌دهید به روش خودتان آنها را انجام دهید.", answer: true, id: 1},
            ],
        },
        {
            id: 17,
            question: "نویسنده‌ها باید:",
            choices: [
                { text: "راستگو باشند و به آنچه می‌نویسند ایمان داشته باشند.", answer: true, id: 0},
                { text: "اتفاقات را با تشبیه و استعارات بیان کنند.", answer: true, id: 1},
            ],
        },
        {
            id: 18,
            question: "کدام مورد برای شما مهم‌تر است؟",
            choices: [
                { text: "پایداری در اندیشه", answer: true, id: 0},
                { text: "روابط دوستانه", answer: true, id: 1},
            ],
        },
        {
            id: 19,
            question: "کدام مورد برای شما راحتتراست؟",
            choices: [
                { text: "قضاوت منطقی", answer: true, id: 0},
                { text: "قضاوت ارزشی", answer: true, id: 1},
            ],
        },
        {
            id: 20,
            question: "می‌خواهید چیزها:",
            choices: [
                { text: "مشخص و تصمیم گرفته شده باشند.", answer: true, id: 0},
                { text: "نامشخص باشند.", answer: true, id: 1},
            ],
        },
        {
            id: 21,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "جدی و مصمم هستید.", answer: true, id: 0},
                { text: "آسان‌‌گیر هستید.", answer: true, id: 1},
            ],
        },
        {
            id: 22,
            question: "در تماس تلفنی:",
            choices: [
                { text: "به ندرت شک دارید که همه چیز گفته می‌شود.", answer: true, id: 0},
                { text: "آنچه می‌خواهید بگویید را از قبل تمرین می‌کنید.", answer: true, id: 1},
            ],
        },
        {
            id: 23,
            question: "حقایق:",
            choices: [
                { text: "خودشان گویا هستند.", answer: true, id: 0},
                { text: "اصول را توضیح می‌دهند.", answer: true, id: 1},
            ],
        },
        {
            id: 24,
            question: "انسان‌های رویاپرداز:",
            choices: [
                { text: "آزاردهنده هستند.", answer: true, id: 0},
                { text: "جالب و هیجان‌انگیز هستند.", answer: true, id: 1},
            ],
        },
        {
            id: 25,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "خونسرد هستید.", answer: true, id: 0},
                { text: "خونگرم هستید.", answer: true, id: 1},
            ],
        },
        {
            id: 26,
            question: "کدام گزینه بدتر است؟",
            choices: [
                { text: "بی انصافی", answer: true, id: 0},
                { text: "بی رحمی", answer: true, id: 1},
            ],
        },
        {
            id: 27,
            question: "آیا رویدادها باید:",
            choices: [
                { text: "با انتخاب دقیق  رخ دهند.", answer: true, id: 0},
                { text: "به صورت رندوم و شانسی رخ دهند.", answer: true, id: 1},
            ],
        },
        {
            id: 28,
            question: "کدام گزینه به شما حس بهتری می‌دهد؟",
            choices: [
                { text: "خرید کردن", answer: true, id: 0},
                { text: "امکان خرید داشتن", answer: true, id: 1},
            ],
        },
        {
            id: 29,
            question: "در جمع دیگران:",
            choices: [
                { text: "صحبت را شروع می‌کنید.", answer: true, id: 0},
                { text: "منتظر می‌مانید تا دیگران با شما صحبت را شروع کنند.", answer: true, id: 1},
            ],
        },
        {
            id: 30,
            question: "کدام مورد درست است؟",
            choices: [
                { text: "عقل سلیم به ندرت اشتباه می‌کند.", answer: true, id: 0},
                { text: "به وفور اشتباه می‌کند.", answer: true, id: 1},
            ],
        },
        ///////////////////////////////////////////////////////////////////
        {
            id: 31,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "برای عدل و انصاف ارزش زيادی قائلم.", answer: true, id: 0},
                { text: "برای بذل و بخشش ارزش زيادی قائلم.", answer: true, id: 1},
            ],
        },
        {
            id: 32,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "تهيۀ فهرست از کار‌هايی که بايد در روز تعطيل انجام داد را کاری بيهوده و عبث می‌دانم.", answer: true, id: 0},
                { text: "تهيۀ فهرست از کارهايی که بايد در روز تعطيل انجام داد را کاری جدی و سودمند می‌دانم.", answer: true, id: 1},
            ],
        },
        {
            id: 33,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "معمولاً در مهمانی‌ها و مجالس با شخص يا اشخاصی که از قبل می‌شناسم گفتگو می‌کنم.", answer: true, id: 0},
                { text: "معمولاً در مهمانی‌ها و مجالس به دنبال اشخاص جديدی هستم تا با آن‌ها گفتگو کرده و آشنا شوم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 34,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "دوستان من اکثراً واقع‌گرا و واقع‌بين هستند.", answer: true, id: 0},
                { text: "دوستان من اکثراً کسانی هستند که قوۀ تخيل قوی دارند.", answer: true, id: 1},
            ],
        },
        {
            id: 35,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "به نظر من فردی که با دلايل و استدلال با موضوعات برخورد می‌کند، بهتر است.", answer: true, id: 0},
                { text: "به نظر من فردی که با عاطفه و احساس واقعی و دلسوزی با موضوعات برخورد می‌کند، بهتر است.", answer: true, id: 1},
            ],
        },
        {
            id: 36,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "غالباً خود را ملزم به انجام کارها در سر وقت معين و مشخص ندانسته و خود را در محدودۀ زمان مقيد نمی‌کنم.", answer: true, id: 0},
                { text: "غالباً برنامۀ خود را به طور مشخص و دقيق تعيين کرده و بر انجام آن‌ها در سر وقت مقرر اصرار می‌ورزم.", answer: true, id: 1},
            ],
        },
        {
            id: 37,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "آرام و متفکر هستم.", answer: true, id: 0},
                { text: "با نشاط و فعال هستم.", answer: true, id: 1},
            ],
        },
        {
            id: 38,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "دوست دارم فردی واقع‌گرا و دقيق باشم.", answer: true, id: 0},
                { text: "دوست دارم فردی مبتکر و خلاق باشم.", answer: true, id: 1},
            ],
        },
        {
            id: 39,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "به تجزيه و تحليل موضوعات علاقه دارم.", answer: true, id: 0},
                { text: "به فيلم‌ها و بحث‌های عاطفی که به مسائل انسانی می‌پردازند، علاقه دارم.", answer: true, id: 1},
            ],
        },
        {
            id: 40,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "معمولاً زندگی خود را با توجه به اوضاع واحوالی که پيش مي‌آيد ، تنظيم و اداره می‌کنم.", answer: true, id: 0},
                { text: "معمولاً کارهايی را که مايل به انجام آن هستم يادداشت کرده يا حداقل به طور مرتب به خاطر می‌سپارم.", answer: true, id: 1},
            ],
        },
        {
            id: 41,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "کم حرف هستم.", answer: true, id: 0},
                { text: "خوش صحبت هستم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 42,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text:"هر ايدۀ جديدی را اگر قابل اجرا باشد می‌پذيرم.", answer: true, id: 0},
                { text: "براي هر ايدۀ جديدی به دليل نو بودن آن (بدون توجه به اجرايی بودن يا نبودن آن) ارزش زيادی قائل هستم.", answer: true, id: 1},
            ],
        },
        {
            id: 43,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "دوست دارم فردی متفکر باشم که عاقلانه رفتار می‌کند.", answer: true, id: 0},
                { text: "دوست دارم فردی عاطفی باشم که با احساسات انسانی رفتار می‌کند.", answer: true, id: 1},
            ],
        },
        {
            id: 44,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "بعضی افراد مرا آدمی بی‌نظم و دارای زندگی شلوغ می‌دانند.", answer: true, id: 0},
                { text: "بعضی افراد مرا آدمی خشک و غير قابل انعطاف می‌دانند.", answer: true, id: 1},
            ],
        },
        {
            id: 45,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "پس از مکث و تأمل کافی، نسبت به بحث يا سؤالات مطرح شده اظهار نظر می‌کنم.", answer: true, id: 0},
                { text: "در هر لحظه که فرصت شد سؤالات را مطرح يا نظر خود را اعلام می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 46,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "ثبات و استحکام را دوست دارم.", answer: true, id: 0},
                { text: "تغيير و انعطاف را دوست دارم.", answer: true, id: 1},
            ],
        },
        {
            id: 47,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "بيشتر از نتيجه‌گيری‌های منطقی و استدلال استفاده می‌کنم.", answer: true, id: 0},
                { text: "بيشتر بر اساس عواطف و عقايد شخصی نسبت به زندگی يا افراد عمل می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 48,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "هر وقت که مناسب بود و فرصت دست داد نسبت به انجام کارها آزادانه و بدون فشار اقدام می‌کنم.", answer: true, id: 0},
                { text: "اين مهم است که از قبل بدانم چه کاری يا چه چيزی از من انتظار دارند تا به انجام آن‌ها بپردازم.", answer: true, id: 1},
            ],
        },
        {
            id: 49,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "ترجيح می‌دهم در جمع افراد توسط فرد ديگری معرفی شوم.", answer: true, id: 0},
                { text: "معمولاً در جمع، ديگران را به يکديگر معرفی می‌کنم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 50,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "تلاش می‌کنم با رعايت ترتيب، مراحل پيش بينی شده کارها را انجام دهم.", answer: true, id: 0},
                { text: "هنگام انجام دادن کارها از قسمت‌های بی اهميت آن صرف نظر می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 51,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "نسبت به هر گروه يا افراد سازمانی که با آن‌ها کار می‌کنم ، براساس تجزيه و تحليل دقيق اوضاع و اطلاعات موجود اظهار نظر می‌کنم.", answer: true, id: 0},
                { text: "نسبت به هر گروه يا افراد سازمانی که با آن‌ها کار می‌کنم ، براساس درک نيازهايشان، عواطف انسانی و خود را به جاي آن‌ها گذاشتن اظهار نظر می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 52,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "معمولاً بدون فوت وقت يک کار يا پروژه را شروع و به هر قسمتی از آن که ممکن باشد زودتر می‌پردازم.", answer: true, id: 0},
                { text: "معمولاً در انجام کارها آن‌ها را به اجزاي مشخص تقسيم کرده وسپس به ترتيب به انجام بخش‌های مشخص شده می‌پردازم.", answer: true, id: 1},
            ],
        },
        {
            id: 53,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "به کارهای فردی (يا حداکثر با يکی دو نفر ديگر) علاقمندم.", answer: true, id: 0},
                { text: "به کارهای گروهی علاقمندم.", answer: true, id: 1},
            ],
        },
        {
            id: 54,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "يکي از اشکالات اساسی زندگی من، يکنواختی و چسبيدن به برنامه و کار مشخص بوده است.", answer: true, id: 0},
                { text: "يکي از اشکالات اساسی زندگی من از شاخه‌ای به شاخۀ دیگر پريدن و داشتن برنامه‌های متعدد بوده است.", answer: true, id: 1},
            ],
        },
        {
            id: 55,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "قاطع بودن برای من اولويت است.", answer: true, id: 0},
                { text: "ملايم و احساسی بودن برای من اولويت است.", answer: true, id: 1},
            ],
        },
        {
            id: 56,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "علاقمندم جلسات و گردهمايی‌ها هنگامی شروع شود که همگی افراد حضور و آمادگی لازم را داشته و احساس راحتی کنند.", answer: true, id: 0},
                { text: "علاقه‌مندم جلسات رأس ساعت مقرر شروع شود و روی وقت‌شناسی تأکيد دارم.", answer: true, id: 1},
            ],
        },
        {
            id: 57,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "از نظر ديگران ممکن است تا حدی گوشه‌گير به نظر برسم.", answer: true, id: 0},
                { text: "از نظر ديگران ممکن است فردی خوش صحبت به نظر برسم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 58,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "کارها را با نظم و ترتيب و مرحله به مرحله انجام می‌دهم.", answer: true, id: 0},
                { text: "قسمت‌های مهم و جالب کار را زودتر انجام می‌دهم.", answer: true, id: 1},
            ],
        },
        {
            id: 59,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "رعايت اصول و قوانين برايم بسيار مهم است.", answer: true, id: 0},
                { text: "مهربانی و گذشت در زندگی برايم بسيار مهم است.", answer: true, id: 1},
            ],
        },
        {
            id: 60,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "مقيد بودن به برنامه‌ای که از قبل مشخص شده باشد برای من جالب نيست.", answer: true, id: 0},
                { text: "از انجام دادن کارهايی که از قبل مشخص شده باشد احساس رضايت دارم.", answer: true, id: 1},
            ],
        }, 
        {
            id: 61,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "نسبت به هر گروه يا افراد سازمانی که با آن‌ها کار می‌کنم ، براساس تجزيه و تحليل دقيق اوضاع و اطلاعات موجود اظهار نظر می‌کنم.", answer: true, id: 0},
                { text: "نسبت به هر گروه يا افراد سازمانی که با آن‌ها کار می‌کنم ، براساس درک نيازهايشان، عواطف انسانی و خود را به جاي آن‌ها گذاشتن اظهار نظر می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 62,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "معمولاً بدون فوت وقت يک کار يا پروژه را شروع و به هر قسمتی از آن که ممکن باشد زودتر می‌پردازم.", answer: true, id: 0},
                { text: "معمولاً در انجام کارها آن‌ها را به اجزاي مشخص تقسيم کرده وسپس به ترتيب به انجام بخش‌های مشخص شده می‌پردازم.", answer: true, id: 1},
            ],
        },
        {
            id: 63,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "به کارهای فردی (يا حداکثر با يکی دو نفر ديگر) علاقمندم.", answer: true, id: 0},
                { text: "به کارهای گروهی علاقمندم.", answer: true, id: 1},
            ],
        },
        {
            id: 64,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "يکي از اشکالات اساسی زندگی من، يکنواختی و چسبيدن به برنامه و کار مشخص بوده است.", answer: true, id: 0},
                { text: "يکي از اشکالات اساسی زندگی من از شاخه‌ای به شاخۀ دیگر پريدن و داشتن برنامه‌های متعدد بوده است.", answer: true, id: 1},
            ],
        },
        {
            id: 65,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "قاطع بودن برای من اولويت است.", answer: true, id: 0},
                { text: "ملايم و احساسی بودن برای من اولويت است.", answer: true, id: 1},
            ],
        },
        {
            id: 66,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "علاقمندم جلسات و گردهمايی‌ها هنگامی شروع شود که همگی افراد حضور و آمادگی لازم را داشته و احساس راحتی کنند.", answer: true, id: 0},
                { text: "علاقه‌مندم جلسات رأس ساعت مقرر شروع شود و روی وقت‌شناسی تأکيد دارم.", answer: true, id: 1},
            ],
        },
        {
            id: 67,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "از نظر ديگران ممکن است تا حدی گوشه‌گير به نظر برسم.", answer: true, id: 0},
                { text: "از نظر ديگران ممکن است فردی خوش صحبت به نظر برسم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 68,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "کارها را با نظم و ترتيب و مرحله به مرحله انجام می‌دهم.", answer: true, id: 0},
                { text: "قسمت‌های مهم و جالب کار را زودتر انجام می‌دهم.", answer: true, id: 1},
            ],
        },
        {
            id: 69,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "رعايت اصول و قوانين برايم بسيار مهم است.", answer: true, id: 0},
                { text: "مهربانی و گذشت در زندگی برايم بسيار مهم است.", answer: true, id: 1},
            ],
        },
        {
            id: 70,
            question: "کدام گزینه توصیف دقیق‌تری از شماست؟",
            choices: [
                { text: "مقيد بودن به برنامه‌ای که از قبل مشخص شده باشد برای من جالب نيست.", answer: true, id: 0},
                { text: "از انجام دادن کارهايی که از قبل مشخص شده باشد احساس رضايت دارم.", answer: true, id: 1},
            ],
        }, 
    ]
}

export default MBTI;