const MBTI = {
    totalQuestions: 60,
    questions: [
        {
            id: 0,
            question: "این تست دارای ۶۰ سوال است. در پاسخ به سوالات، گزینه‌ای را انتخاب کنید که به شخصیت واقعی شما نزدیک‌‌تر است نه ویژگی‌هایی که می‌خواهید داشته باشید. پاسخ درست یا غلط وجود ندارد. به تمامی سوالات با دقت پاسخ دهید.",
            choices: [],
        },
        {
            id: 1,
            question: "عبارات:",
            choices: [
                { text: "معمولاً احساسات و عواطف خود را در خويش نگه می‌دارم.", answer: true, id: 0},
                { text: "معمولاً احساسات و عواطف خودرا با ديگران و به راحتی درميان می‌گذارم.", answer: true, id: 1},
            ],
        },
        {
            id: 2,
            question: "عبارات:",
            choices: [
                { text: "برای من امور قطعی، عينی و مشخص مهم هستند.", answer: true, id: 0},
                { text: "برای من ايده‌ها، استنباط‌ها و الهامات مهم هستند.", answer: true, id: 1},
            ],
        },
        {
            id: 3,
            question: "عبارات:",
            choices: [
                { text: "هنگام تصميم‌گيری به آنچه که منطق و خرد بر آن حکم می‌کند، عمل می‌کنم.", answer: true, id: 0},
                { text: "هنگام تصميم‌گيری به آنچه که احساسات و دلم گواه می‌دهد، عمل می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 4,
            question: "عبارات:",
            choices: [
                { text: "دوست دارم در شرايط انعطاف پذير و متغيری زندگی کنم.", answer: true, id: 0},
                { text: "دوست دارم همه چيز منظم و برنامه ريزی شده باشد.", answer: true, id: 1},
            ],
        },
        {
            id: 5,
            question: "عبارات:",
            choices: [
                { text: "دوست دارم در زمينه‌های محدودی اطلاعات داشته باشم ولي در هر زمينه عميق و کامل.", answer: true, id: 0},
                { text: "دوست دارم در زمينه‌های زيادی اطلاعات داشته باشم ولی در هر زمينه تا حد کم و سطحی.", answer: true, id: 1},
            ],
        },
        {
            id: 6,
            question: "عبارات:",
            choices: [
                { text: "بيشتر اوقات به واقعيات عينی (آنچه که وجود دارد) توجه می‌کنم.", answer: true, id: 0},
                { text: "بيشتر اوقات حقايق (آنچه که بايد وجود داشته باشد) را در ذهن و تخيل خود مجسم می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 7,
            question: "عبارات:",
            choices: [
                { text: "از نظر من يک قاضی و داور عادل براي جامعه مفيدتر است.", answer: true, id: 0},
                { text: "از نظر من يک معلم و مربی مهربان برای جامعه مفيدتر است.", answer: true, id: 1},
            ],
        },
        {
            id: 8,
            question: "عبارات:",
            choices: [
                { text: "ترجيحاً ملاقات‌ها و ديدارهای خود را بدون برنامۀ قبلی و آزادانه انجام می‌دهم.", answer: true, id: 0},
                { text: "ترجيحاً ديدار با افراد و وعدۀ ملاقات خود را از پيش تعيين می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 9,
            question: "عبارات:",
            choices: [
                { text: "کم‌حرف و محتاط هستم و علاقه‌ای به جلب توجه ديگران به خود ندارم.", answer: true, id: 0},
                { text: "توجه ديگران را به خود جلب می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 10,
            question: "عبارات:",
            choices: [
                { text: "اگر معلم بودم ترجيح می‌دادم دروسي را تدريس کنم که واقعيات و امور قطعی و عينی را شامل شوند.", answer: true, id: 0},
                { text: "اگر معلم بودم، ترجيحاً دروسی را تدريس می‌کردم که حقايق و نظريه‌ها و تئوری‌ها را شامل شوند (مانند فلسفه).", answer: true, id: 1},
            ],
        },
        {
            id: 11,
            question: "عبارات:",
            choices: [
                { text: "قاطع، محکم و استوار هستم.", answer: true, id: 0},
                { text: "انعطاف پذير، ملايم و لطيف هستم.", answer: true, id: 1},
            ],
        },
        {
            id: 12,
            question: "عبارات:",
            choices: [
                { text: "غالباً انجام کارهای پيش پا افتاده و جزئی را فراموش می‌کنم.", answer: true, id: 0},
                { text: "به منظور جلوگيری از فراموش شدن انجام کارها، آن‌ها را يادداشت می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 13,
            question: "عبارات:",
            choices: [
                { text: "در مهمانی‌ها، جلسات و گردهمايی‌ها منتظر می‌مانم تا ديگران به سوی من بيايند.", answer: true, id: 0},
                { text: "در مهمانی‌ها، جلسات و گردهمايی‌ها، من سر صحبت را با ديگران باز می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 14,
            question: "عبارات:",
            choices: [
                { text: "به جزئيات امور توجه زيادی دارم.", answer: true, id: 0},
                { text: "بيشتر کليت هر موضوعی برايم مهم است و به جزئيات آن توجه زيادی نمی‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 15,
            question: "عبارات:",
            choices: [
                { text: "به آينده اهميت زيادی داده و برای آن برنامه ريزی می‌کنم.", answer: true, id: 0},
                { text: "خيلی به آينده فکر نمی‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 16,
            question: "عبارات:",
            choices: [
                { text: "معمولاً کارها را شروع می‌کنم و حين اجرا به رفع اشکالات اجرايی و تدارک مورد نياز می‌پردازم.", answer: true, id: 0},
                { text: "قبل از اجرای طرح‌ها وکارها برنامه ريزی انجام می‌دهم.", answer: true, id: 1},
            ],
        },
        {
            id: 17,
            question: "عبارات:",
            choices: [
                { text: "مايل هستم دوستان کم همراه با ارتباط زياد و صميمانه داشته باشم.", answer: true, id: 0},
                { text: "مايل هستم دوستان زياد همراه با ارتباط محدود داشته باشم.", answer: true, id: 1},
            ],
        },
        {
            id: 18,
            question: "عبارات:",
            choices: [
                { text: "به استفاده از امکانات و توانايی‌های موجود تاکيد دارم.", answer: true, id: 0},
                { text: "نوآوری و خلاقيت داشتن در کارها برايم اولويت دارد.", answer: true, id: 1},
            ],
        },
        {
            id: 19,
            question: "عبارات:",
            choices: [
                { text: "بيشتر پيروِ منطق و دليل هستم.", answer: true, id: 0},
                { text: "بيشتر پيروِ احساس و عاطفه هستم.", answer: true, id: 1},
            ],
        },
        {
            id: 20,
            question: "عبارات:",
            choices: [
                { text: "در انجام کارهايی که از قبل پيش بينی نشده و يا فعاليت‌هايی که به سرعت و عکس العمل فوری نياز دارد، موفق هستم.", answer: true, id: 0},
                { text: "در انجام کارهايی که بر اساس طرح و برنامه قبلی مي باشد موفق هستم.", answer: true, id: 1},
            ],
        },
        {
            id: 21,
            question: "عبارات:",
            choices: [
                { text: "به طور معمول دوستان کمی داشته ولي روابط صميمانه‌ای با آن‌ها دارم.", answer: true, id: 0},
                { text: "به طور معمول با افراد زيادی دوستی و آشنايی دارم.", answer: true, id: 1},
            ],
        },
        {
            id: 22,
            question: "عبارات:",
            choices: [
                { text: "عمدتا از زندگی در زمان حال لذت زيادی برده و خيلي به آينده فکر نمی‌کنم.", answer: true, id: 0},
                { text: "به آينده توجه زيادی داشته و آن را پيش‌بينی می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 23,
            question: "عبارات:",
            choices: [
                { text: "معمولا مغز من بر قلب من حاکم است.", answer: true, id: 0},
                { text: "معمولا قلب من بر مغز من حاکم است.", answer: true, id: 1},
            ],
        },
        {
            id: 24,
            question: "عبارات:",
            choices: [
                { text: "معمولاً در کارهای روزانه مايلم بر حسب ضرورت‌ها و فوريت‌هايی که پيش می‌آيد عمل کنم.", answer: true, id: 0},
                { text: "معمولاً در کارهای روزانه مايلم که طبق برنامه عمل کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 25,
            question: "عبارات:",
            choices: [
                { text: "از احساسات و عواطف درونی خود کمتر با ديگران صحبت می‌کنم.", answer: true, id: 0},
                { text: "افکار و عواطف خود را آزاد و راحت بيان می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 26,
            question: "عبارات:",
            choices: [
                { text: "کلمات مشخص و دقيق را ترجيح داده و بکار مي‌برم.", answer: true, id: 0},
                { text: "کلمات تمثيلی و کنايه‌ای را ترجيح داده و بکار می‌برم.", answer: true, id: 1},
            ],
        },
        {
            id: 27,
            question: "عبارات:",
            choices: [
                { text: "در تصميم گيری‌ها رعايت عدالت و انصاف از همه چيز برايم مهم‌تر است.", answer: true, id: 0},
                { text: "در تصميم گيری‌ها رعايت حال و شرايط ديگران از همه چيز برايم مهم‌تر است.", answer: true, id: 1},
            ],
        },
        {
            id: 28,
            question: "عبارات:",
            choices: [
                { text: "معمولاً کارها را شروع می‌کنم و در حين اجرا به رفع مشکلات پيش آمده می‌پردازم.", answer: true, id: 0},
                { text: "معمولاً قبل از شروع کارها مقدمات کار را آماده و مشکلات را پيش‌ بينی می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 29,
            question: "عبارات:",
            choices: [
                { text: "کارهای فردی را ترجيح می‌دهم.", answer: true, id: 0},
                { text:"کارهای گروهی را ترجيح می‌دهم.", answer: true, id: 1},
            ],
        },
        {
            id: 30,
            question: "عبارات:",
            choices: [
                { text: "واقعيات (آنچه که هست) و پديده‌ها برايم جالب اند.", answer: true, id: 0},
                { text: "حقايق (آنچه که بايد باشد) و ايده‌ها برايم جالب اند.", answer: true, id: 1},
            ],
        },
        {
            id: 31,
            question: "عبارات:",
            choices: [
                { text: "برای عدل و انصاف ارزش زيادی قائلم.", answer: true, id: 0},
                { text: "برای بذل و بخشش ارزش زيادی قائلم.", answer: true, id: 1},
            ],
        },
        {
            id: 32,
            question: "عبارات:",
            choices: [
                { text: "تهيۀ فهرست از کار‌هايی که بايد در روز تعطيل انجام داد را کاری بيهوده و عبث می‌دانم.", answer: true, id: 0},
                { text: "تهيۀ فهرست از کارهايی که بايد در روز تعطيل انجام داد را کاری جدی و سودمند می‌دانم.", answer: true, id: 1},
            ],
        },
        {
            id: 33,
            question: "عبارات:",
            choices: [
                { text: "معمولاً در مهمانی‌ها و مجالس با شخص يا اشخاصی که از قبل می‌شناسم گفتگو می‌کنم.", answer: true, id: 0},
                { text: "معمولاً در مهمانی‌ها و مجالس به دنبال اشخاص جديدی هستم تا با آن‌ها گفتگو کرده و آشنا شوم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 34,
            question: "عبارات:",
            choices: [
                { text: "دوستان من اکثراً واقع‌گرا و واقع‌بين هستند.", answer: true, id: 0},
                { text: "دوستان من اکثراً کسانی هستند که قوۀ تخيل قوی دارند.", answer: true, id: 1},
            ],
        },
        {
            id: 35,
            question: "عبارات:",
            choices: [
                { text: "به نظر من فردی که با دلايل و استدلال با موضوعات برخورد می‌کند، بهتر است.", answer: true, id: 0},
                { text: "به نظر من فردی که با عاطفه و احساس واقعی و دلسوزی با موضوعات برخورد می‌کند، بهتر است.", answer: true, id: 1},
            ],
        },
        {
            id: 36,
            question: "عبارات:",
            choices: [
                { text: "غالباً خود را ملزم به انجام کارها در سر وقت معين و مشخص ندانسته و خود را در محدودۀ زمان مقيد نمی‌کنم.", answer: true, id: 0},
                { text: "غالباً برنامۀ خود را به طور مشخص و دقيق تعيين کرده و بر انجام آن‌ها در سر وقت مقرر اصرار می‌ورزم.", answer: true, id: 1},
            ],
        },
        {
            id: 37,
            question: "عبارات:",
            choices: [
                { text: "آرام و متفکر هستم.", answer: true, id: 0},
                { text: "با نشاط و فعال هستم.", answer: true, id: 1},
            ],
        },
        {
            id: 38,
            question: "عبارات:",
            choices: [
                { text: "دوست دارم فردی واقع‌گرا و دقيق باشم.", answer: true, id: 0},
                { text: "دوست دارم فردی مبتکر و خلاق باشم.", answer: true, id: 1},
            ],
        },
        {
            id: 39,
            question: "عبارات:",
            choices: [
                { text: "به تجزيه و تحليل موضوعات علاقه دارم.", answer: true, id: 0},
                { text: "به فيلم‌ها و بحث‌های عاطفی که به مسائل انسانی می‌پردازند، علاقه دارم.", answer: true, id: 1},
            ],
        },
        {
            id: 40,
            question: "عبارات:",
            choices: [
                { text: "معمولاً زندگی خود را با توجه به اوضاع واحوالی که پيش مي‌آيد ، تنظيم و اداره می‌کنم.", answer: true, id: 0},
                { text: "معمولاً کارهايی را که مايل به انجام آن هستم يادداشت کرده يا حداقل به طور مرتب به خاطر می‌سپارم.", answer: true, id: 1},
            ],
        },
        {
            id: 41,
            question: "عبارات:",
            choices: [
                { text: "کم حرف هستم.", answer: true, id: 0},
                { text: "خوش صحبت هستم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 42,
            question: "عبارات:",
            choices: [
                { text:"هر ايدۀ جديدی را اگر قابل اجرا باشد می‌پذيرم.", answer: true, id: 0},
                { text: "براي هر ايدۀ جديدی به دليل نو بودن آن (بدون توجه به اجرايی بودن يا نبودن آن) ارزش زيادی قائل هستم.", answer: true, id: 1},
            ],
        },
        {
            id: 43,
            question: "عبارات:",
            choices: [
                { text: "دوست دارم فردی متفکر باشم که عاقلانه رفتار می‌کند.", answer: true, id: 0},
                { text: "دوست دارم فردی عاطفی باشم که با احساسات انسانی رفتار می‌کند.", answer: true, id: 1},
            ],
        },
        {
            id: 44,
            question: "عبارات:",
            choices: [
                { text: "بعضی افراد مرا آدمی بی‌نظم و دارای زندگی شلوغ می‌دانند.", answer: true, id: 0},
                { text: "بعضی افراد مرا آدمی خشک و غير قابل انعطاف می‌دانند.", answer: true, id: 1},
            ],
        },
        {
            id: 45,
            question: "عبارات:",
            choices: [
                { text: "پس از مکث و تأمل کافی، نسبت به بحث يا سؤالات مطرح شده اظهار نظر می‌کنم.", answer: true, id: 0},
                { text: "در هر لحظه که فرصت شد سؤالات را مطرح يا نظر خود را اعلام می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 46,
            question: "عبارات:",
            choices: [
                { text: "ثبات و استحکام را دوست دارم.", answer: true, id: 0},
                { text: "تغيير و انعطاف را دوست دارم.", answer: true, id: 1},
            ],
        },
        {
            id: 47,
            question: "عبارات:",
            choices: [
                { text: "بيشتر از نتيجه‌گيری‌های منطقی و استدلال استفاده می‌کنم.", answer: true, id: 0},
                { text: "بيشتر بر اساس عواطف و عقايد شخصی نسبت به زندگی يا افراد عمل می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 48,
            question: "عبارات:",
            choices: [
                { text: "هر وقت که مناسب بود و فرصت دست داد نسبت به انجام کارها آزادانه و بدون فشار اقدام می‌کنم.", answer: true, id: 0},
                { text: "اين مهم است که از قبل بدانم چه کاری يا چه چيزی از من انتظار دارند تا به انجام آن‌ها بپردازم.", answer: true, id: 1},
            ],
        },
        {
            id: 49,
            question: "عبارات:",
            choices: [
                { text: "ترجيح می‌دهم در جمع افراد توسط فرد ديگری معرفی شوم.", answer: true, id: 0},
                { text: "معمولاً در جمع، ديگران را به يکديگر معرفی می‌کنم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 50,
            question: "عبارات:",
            choices: [
                { text: "تلاش می‌کنم با رعايت ترتيب، مراحل پيش بينی شده کارها را انجام دهم.", answer: true, id: 0},
                { text: "هنگام انجام دادن کارها از قسمت‌های بی اهميت آن صرف نظر می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 51,
            question: "عبارات:",
            choices: [
                { text: "نسبت به هر گروه يا افراد سازمانی که با آن‌ها کار می‌کنم ، براساس تجزيه و تحليل دقيق اوضاع و اطلاعات موجود اظهار نظر می‌کنم.", answer: true, id: 0},
                { text: "نسبت به هر گروه يا افراد سازمانی که با آن‌ها کار می‌کنم ، براساس درک نيازهايشان، عواطف انسانی و خود را به جاي آن‌ها گذاشتن اظهار نظر می‌کنم.", answer: true, id: 1},
            ],
        },
        {
            id: 52,
            question: "عبارات:",
            choices: [
                { text: "معمولاً بدون فوت وقت يک کار يا پروژه را شروع و به هر قسمتی از آن که ممکن باشد زودتر می‌پردازم.", answer: true, id: 0},
                { text: "معمولاً در انجام کارها آن‌ها را به اجزاي مشخص تقسيم کرده وسپس به ترتيب به انجام بخش‌های مشخص شده می‌پردازم.", answer: true, id: 1},
            ],
        },
        {
            id: 53,
            question: "عبارات:",
            choices: [
                { text: "به کارهای فردی (يا حداکثر با يکی دو نفر ديگر) علاقمندم.", answer: true, id: 0},
                { text: "به کارهای گروهی علاقمندم.", answer: true, id: 1},
            ],
        },
        {
            id: 54,
            question: "عبارات:",
            choices: [
                { text: "يکي از اشکالات اساسی زندگی من، يکنواختی و چسبيدن به برنامه و کار مشخص بوده است.", answer: true, id: 0},
                { text: "يکي از اشکالات اساسی زندگی من از شاخه‌ای به شاخۀ دیگر پريدن و داشتن برنامه‌های متعدد بوده است.", answer: true, id: 1},
            ],
        },
        {
            id: 55,
            question: "عبارات:",
            choices: [
                { text: "قاطع بودن برای من اولويت است.", answer: true, id: 0},
                { text: "ملايم و احساسی بودن برای من اولويت است.", answer: true, id: 1},
            ],
        },
        {
            id: 56,
            question: "عبارات:",
            choices: [
                { text: "علاقمندم جلسات و گردهمايی‌ها هنگامی شروع شود که همگی افراد حضور و آمادگی لازم را داشته و احساس راحتی کنند.", answer: true, id: 0},
                { text: "علاقه‌مندم جلسات رأس ساعت مقرر شروع شود و روی وقت‌شناسی تأکيد دارم.", answer: true, id: 1},
            ],
        },
        {
            id: 57,
            question: "عبارات:",
            choices: [
                { text: "از نظر ديگران ممکن است تا حدی گوشه‌گير به نظر برسم.", answer: true, id: 0},
                { text: "از نظر ديگران ممکن است فردی خوش صحبت به نظر برسم.", answer: true, id: 1},
            ],
        },
        
        {
            id: 58,
            question: "عبارات:",
            choices: [
                { text: "کارها را با نظم و ترتيب و مرحله به مرحله انجام می‌دهم.", answer: true, id: 0},
                { text: "قسمت‌های مهم و جالب کار را زودتر انجام می‌دهم.", answer: true, id: 1},
            ],
        },
        {
            id: 59,
            question: "عبارات:",
            choices: [
                { text: "رعايت اصول و قوانين برايم بسيار مهم است.", answer: true, id: 0},
                { text: "مهربانی و گذشت در زندگی برايم بسيار مهم است.", answer: true, id: 1},
            ],
        },
        {
            id: 60,
            question: "عبارات:",
            choices: [
                { text: "مقيد بودن به برنامه‌ای که از قبل مشخص شده باشد برای من جالب نيست.", answer: true, id: 0},
                { text: "از انجام دادن کارهايی که از قبل مشخص شده باشد احساس رضايت دارم.", answer: true, id: 1},
            ],
        }, 
    ]
}

export default MBTI;